Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Toggle Fold
fr: Changer le pliage
ko: 접기 전환
tr: Katlamayı Aç/Kapat
vi: Bật/tắt thu gọn
zh_hans: 切换折叠
zh_hant: 切換摺疊

source: Failed to render the diagram image.
fr: Échec de la représentation de l'image du schéma.
ko: 다이어그램 이미지를 렌더링하지 못했습니다.
tr: Diyagram görüntüsü oluşturulamadı.
vi: Không thể tạo hình ảnh sơ đồ.
zh_hans: 无法渲染图表图像。
zh_hant: 無法繪製圖表影像。

source: No objects match "%@"
fr: Aucun objet ne correspond à "%@"
ko: "%@"과 일치하는 객체 없음
vi: Không có đối tượng phù hợp với "%@"
zh_hans: 没有匹配"%@"的对象
zh_hant: 沒有符合「%@」的物件

source: Imported connections ask for a password on first connect.
fr: Les connexions importées demandent un mot de passe lors de la première connexion.

source: Open in Editor
fr: Ouvrir dans l'éditeur
ko: 편집기에서 열기
tr: Düzenleyicide Aç
vi: Mở trong trình soạn thảo
zh_hans: 在编辑器中打开
zh_hant: 在編輯器中開啟

source: Reload
fr: Recharger
ko: 다시 로드
tr: Yeniden Yükle
vi: Tải lại
zh_hans: 重新加载
zh_hant: 重新載入

source: No %1$@ match “%2$@”
fr: Aucune correspondance entre %1$@ et "%2$@"
ko: %1$@ 중 “%2$@”과 일치하는 항목 없음
tr: “%2$@” ile eşleşen %1$@ yok
vi: Không có %1$@ nào khớp “%2$@”
zh_hans: 没有与“%2$@”匹配的%1$@
zh_hant: 沒有與「%2$@」相符的%1$@

source: Cannot execute write queries: connection is read-only
fr: Impossible d'exécuter des requêtes d'écriture : la connexion est en lecture seule.
ko: 쓰기 쿼리를 실행할 수 없습니다. 연결이 읽기 전용입니다.
tr: Yazma sorguları çalıştırılamıyor: bağlantı salt okunur
vi: Không thể thực thi truy vấn ghi: kết nối chỉ đọc
zh_hans: 无法执行写入查询：连接为只读
zh_hant: 無法執行寫入查詢：連線為唯讀

source: SSH Tunnel
fr: Tunnel SSH
ko: SSH 터널
tr: SSH Tüneli
vi: Đường hầm SSH
zh_hans: SSH 隧道
zh_hant: SSH 隧道

source: Schema the partition belongs to, when it is a relation of its own
fr: Schéma à laquelle appartient la partition, lorsqu'elle est une relation à part entière.

source: total %@
fr: %@tal@
ko: 합계 %@
tr: toplam %@
vi: tổng %@
zh_hans: 总计 %@
zh_hant: 總計 %@

source: Ask AI about your database
fr: Demandez à l'IA des informations sur votre base de données.
ko: AI에게 데이터베이스에 대해 질문
tr: Veritabanınız hakkında yapay zekaya sorun
vi: Hỏi AI về cơ sở dữ liệu của bạn
zh_hans: 向 AI 询问您的数据库
zh_hant: 向 AI 詢問你的資料庫

source: Restore Dump Failed
fr: Récupération de la décharge échou
ko: 덤프 복원 실패
tr: Döküm Geri Yükleme Başarısız Oldu
vi: Khôi phục dump thất bại
zh_hans: 转储恢复失败
zh_hant: 還原備份失敗

source: Schema Switch Failed
fr: Échec du commutateur de schéma
ko: 스키마 전환 실패
vi: Chuyển schema thất bại
zh_hans: 切换 Schema 失败
zh_hant: 切換綱要失敗

source: Find and Replace
fr: Trouver et remplacer
ko: 찾기 및 바꾸기
tr: Bul ve Değiştir
vi: Tìm và thay thế
zh_hans: 查找与替换
zh_hant: 尋找與取代

source: Use IAM database authentication
fr: Utiliser l'authentification de la base de données IAM
ko: IAM 데이터베이스 인증 사용
tr: IAM veritabanı kimlik doğrulamasını kullan
vi: Dùng xác thực cơ sở dữ liệu IAM
zh_hans: 使用 IAM 数据库认证
zh_hant: 使用 IAM 資料庫驗證

source: Right-click to show all %@
fr: Cliquez avec le bouton droit de la souris pour afficher tout %@
ko: 마우스 오른쪽 버튼을 클릭하여 모든 %@ 표시
vi: Nhấp chuột phải để hiển thị tất cả %@
zh_hans: 右键点击显示全部%@
zh_hant: 按右鍵以顯示全部 %@

source: Sync this Mac with iCloud
fr: Synchronisez ce Mac avec iCloud
ko: 이 Mac을 iCloud와 동기화
tr: Bu Mac'i iCloud ile eşitle
vi: Đồng bộ máy Mac này với iCloud
zh_hans: 将此 Mac 与 iCloud 同步
zh_hant: 將此 Mac 與 iCloud 同步

source: That object does not exist.
fr: Cet objet n'existe pas.

source: Skips foreign key constraint checks for this operation
fr: Oublie les contrôles de contraintes de clé étrangère pour cette opération.
ko: 이 작업에서 외래 키 제약 조건 검사를 건너뜁니다
tr: Bu işlem için yabancı anahtar kısıtlaması denetimlerini atlar
vi: Bỏ qua kiểm tra ràng buộc khóa ngoại cho thao tác này
zh_hans: 此操作将跳过外键约束检查
zh_hant: 此操作會跳過外鍵約束檢查

source: Checking your credentials
fr: Vérification de vos coordonnées
ko: 자격 증명 확인 중
tr: Kimlik bilgileriniz kontrol ediliyor
vi: Đang kiểm tra thông tin đăng nhập
zh_hans: 正在检查你的凭据
zh_hant: 正在檢查你的憑證

source: Username
fr: Nom d'utilisateur
ko: 사용자 이름
tr: Kullanıcı adı
vi: Tên người dùng
zh_hans: 用户名
zh_hant: 使用者名稱

source: Could not write this text as %@.
fr: Impossible d'écrire ce texte sous forme de %@.
ko: 이 텍스트를 %@(으)로 기록할 수 없습니다.
tr: Bu metin %@ olarak yazılamadı.
vi: Không thể ghi văn bản này ở dạng %@.
zh_hans: 无法以 %@ 写入此文本。
zh_hant: 無法以 %@ 寫入此文字。

source: right parenthesis
fr: Parenthèse droite
ko: 닫는 괄호
tr: sağ parantez
vi: dấu ngoặc đơn đóng
zh_hans: 右括号
zh_hant: 右括號

source: Lossy type change
fr: Changement de type dégradé
ko: 손실이 있는 타입 변경
tr: Kayıplı tür değişikliği
vi: Thay đổi kiểu gây mất dữ liệu
zh_hans: 有损的类型更改
zh_hant: 有損的型別變更

source: Whether the object is a view
fr: Que l'objet soit une vue ou non
ko: 객체가 뷰인지 여부
tr: Nesnenin bir görünüm olup olmadığı
vi: Đối tượng có phải view hay không
zh_hans: 该对象是否为视图
zh_hant: 該物件是否為檢視表

source: Filename is too long (max 255 bytes)
fr: Le nom du fichier est trop long (max 255 octets)
ko: 파일 이름이 너무 깁니다 (최대 255바이트)
tr: Dosya adı çok uzun (maks. 255 bayt)
vi: Tên tệp quá dài (tối đa 255 byte)
zh_hans: 文件名过长（最大 255 字节）
zh_hant: 檔案名稱過長（最多 255 位元組）

source: Compared columns
fr: Colonnes comparées
ko: 비교한 열
tr: Karşılaştırılan sütunlar
vi: Cột được so sánh
zh_hans: 已比较的列
zh_hant: 已比較的欄位

source: Cannot Show DDL
fr: Impossible de montrer la DDL
ko: DDL을 표시할 수 없음
tr: DDL gösterilemiyor
vi: Không thể hiển thị DDL
zh_hans: 无法显示DDL
zh_hant: 無法顯示 DDL

source: Proxy Server
fr: Serveur proxy
ko: 프록시 서버
tr: Proxy Sunucusu
vi: Máy chủ proxy
zh_hans: 代理服务器
zh_hant: 代理伺服器

source: Preview SQL (⌘⇧P)
fr: Aperçu SQL (⌘⇧P)
ko: SQL 미리보기(⌘⇧P)
vi: Xem trước SQL (⌘⇧P)
zh_hans: 预览 SQL (⌘⇧P)
zh_hant: 預覽 SQL (⌘⇧P)

source: Microsoft's enterprise SQL database
fr: La base de données SQL d'entreprise de Microsoft
ko: Microsoft의 엔터프라이즈 SQL 데이터베이스
tr: Microsoft'un kurumsal SQL veritabanı
vi: Cơ sở dữ liệu SQL doanh nghiệp của Microsoft
zh_hans: Microsoft 的企业级 SQL 数据库
zh_hant: Microsoft 的企業級 SQL 資料庫

source: Charts draw the rows the result pane has loaded. Grid selection, Find, hidden columns, and value filters do not change the chart.
fr: Les graphiques dessinent les lignes que le panneau de résultats a chargées. La sélection de la grille, la recherche, les colonnes cachées et les filtres de valeurs ne modifient pas le graphique.
ko: 차트는 결과 창이 불러온 행을 그립니다. 그리드 선택, 찾기, 숨긴 열, 값 필터는 차트를 바꾸지 않습니다.
tr: Grafikler sonuç bölmesinin yüklediği satırları çizer. Tablo seçimi, Bul, gizli sütunlar ve değer filtreleri grafiği değiştirmez.
vi: Biểu đồ vẽ các hàng mà khung kết quả đã tải. Lựa chọn trong lưới, Tìm, cột ẩn và bộ lọc giá trị không làm thay đổi biểu đồ.
zh_hans: 图表绘制结果面板已加载的行。网格选择、查找、隐藏列和值过滤器不会改变图表。
zh_hant: 圖表繪製結果面板已載入的列。表格選取、尋找、隱藏欄和值篩選器不會改變圖表。

source: Any Column
fr: N'importe quelle colonne
ko: 어느 열이든
tr: Herhangi Bir Sütun
vi: Bất kỳ cột nào
zh_hans: 任意列
zh_hant: 任一欄位

source: root
fr: racine

source: Reconnect
fr: Reconnectez-vous
ko: 다시 연결
tr: Yeniden Bağlan
vi: Kết nối lại
zh_hans: 重新连接
zh_hant: 重新連線

source: Refresh the materialized view “%@”?
fr: Rechargez la vue matérialisée "%@"?

source: about %@ row
fr: À propos de la ligne %@

source: Building map
fr: Carte du bâtiment

source: Move to End of Line
fr: Déplacez-vous vers la fin de la ligne
ko: 줄 끝으로 이동
tr: Satırın Sonuna Git
vi: Đến cuối dòng
zh_hans: 移到行尾
zh_hant: 移到行尾

source: Roles it belongs to
fr: Les rôles à lesquels il appartient
ko: 속해 있는 역할
tr: Ait olduğu roller
vi: Các vai trò mà nó thuộc về
zh_hans: 它所属的角色
zh_hant: 它所屬的角色

source: Its WHERE clause is not supported here, so it covers every row.
fr: Sa clause WHERE n'est pas prise en charge ici, donc elle couvre chaque ligne.

source: Enable
fr: Favoriser
ko: 활성화
tr: Etkinleştir
vi: Bật
zh_hans: 启用
zh_hant: 啟用

source: Succeeded
fr: A réussi
ko: 성공
tr: Başarılı
vi: Thành công
zh_hans: 成功
zh_hant: 成功

source: Create connection...
fr: Créer une connexion...
ko: 연결 생성...
tr: Bağlantı oluştur...
vi: Tạo kết nối...
zh_hans: 创建连接...
zh_hant: 建立連線...

source: Cells Where %@
fr: Cellules Où %@

source: Add Jump Host
fr: Ajouter un hôte de saut
ko: 점프 호스트 추가
tr: Atlama Sunucusu Ekle
vi: Thêm Jump Host
zh_hans: 添加跳板机
zh_hant: 新增跳板主機

source: not equals
fr: Pas égaux
ko: 같지 않음
tr: eşit değil
vi: không bằng
zh_hans: 不等于
zh_hant: 不等於

source: No Rows
fr: Pas de rangées

source: Response
fr: Réponse
ko: 응답
tr: Yanıt
vi: Phản hồi
zh_hans: 响应
zh_hant: 回應

source: %1$@ becomes unique on the first %2$lld characters
fr: %1$@ devient unique sur les premiers %2$lld caractères.

source: Row as JSON
fr: Ligne sous forme JSON

source: Integrations: Failed
fr: Intégrations : Échec
ko: 통합: 실패
tr: Entegrasyonlar: Başarısız
vi: Tích hợp: Thất bại
zh_hans: 集成：失败
zh_hant: 整合：失敗

source: Show All Columns
fr: Afficher toutes les colonnes
ko: 모든 열 보기
tr: Tüm Sütunları Göster
vi: Hiện tất cả cột
zh_hans: 显示所有列
zh_hant: 顯示所有欄位

source: A statement on '%1$@' matched %2$d rows instead of %3$d, so nothing was saved.
fr: Une déclaration sur '%1$@' a correspondu à %2$d lignes au lieu de %3$d, donc rien n'a été sauvegardé.
ko: '%1$@'의 명령문이 %3$d개가 아니라 %2$d개 행과 일치하여 아무것도 저장되지 않았습니다.
tr: '%1$@' üzerindeki bir ifade %3$d yerine %2$d satırla eşleşti, bu yüzden hiçbir şey kaydedilmedi.
vi: Một câu lệnh trên '%1$@' khớp %2$d dòng thay vì %3$d, nên không có gì được lưu.
zh_hans: '%1$@' 上的语句匹配了 %2$d 行而不是 %3$d 行，因此未保存任何内容。
zh_hant: '%1$@' 上的陳述式符合 %2$d 列而不是 %3$d 列，因此未儲存任何內容。

source: Create a new table or view
fr: Créez une nouvelle table ou une nouvelle vue
ko: 새 테이블 또는 뷰 생성
tr: Yeni bir tablo veya görünüm oluştur
vi: Tạo bảng hoặc view mới
zh_hans: 新建表或视图
zh_hant: 建立新的資料表或檢視表

source: Sum
fr: Somme

source: Unknown command: %@
fr: Commande inconnue : %@

source: View: %@
fr: Vue : %@
ko: 보기: %@
vi: Chế độ xem: %@
zh_hans: 视图：%@
zh_hant: 檢視表：%@

source: Negotiating encryption
fr: Négociation de cryptage
ko: 암호화 협상 중
tr: Şifreleme görüşülüyor
vi: Đang thương lượng mã hoá
zh_hans: 正在协商加密
zh_hant: 正在協商加密

source: Full Access
fr: Accès complet
ko: 전체 접근 권한
tr: Tam Erişim
vi: Toàn quyền
zh_hans: 完全访问
zh_hant: 完整存取

source: No database settings found in this folder.
fr: Aucune configuration de base de données n'a été trouvée dans ce dossier.
ko: 이 폴더에서 데이터베이스 설정을 찾을 수 없습니다.
tr: Bu klasörde veritabanı ayarı bulunamadı.
vi: Không tìm thấy cài đặt cơ sở dữ liệu trong thư mục này.
zh_hans: 在此文件夹中未找到数据库设置。
zh_hant: 在此資料夾中找不到資料庫設定。

source: Not allowed
fr: Interdit

source: Clear Recents
fr: Effacer les derniers messages
ko: 최근 항목 지우기
tr: Sonları Temizle
vi: Xoá gần đây
zh_hans: 清除最近记录
zh_hant: 清除最近項目

source: Change File
fr: Changer le fichier
ko: 파일 변경
tr: Dosyayı Değiştir
vi: Đổi tệp
zh_hans: 更改文件
zh_hant: 變更檔案

source: Failed to load preview using encoding: %@. Try selecting a different text encoding.
fr: Impossible de charger l'aperçu en utilisant l'encodage : %@. Essayez de sélectionner un autre encodage de texte.
ko: 인코딩(%@)으로 미리보기를 불러오지 못했습니다. 다른 텍스트 인코딩을 선택해 보십시오.
tr: Failed to load Önizleme using encoding: %@. Try selecting a different text encoding.
vi: Không thể tải xem trước với mã hóa: %@. Hãy thử chọn mã hóa văn bản khác.
zh_hans: 无法使用编码 %@ 加载预览。请尝试选择其他文本编码。
zh_hant: 使用編碼 %@ 載入預覽失敗。請嘗試選擇其他文字編碼。

source: Add Column
fr: Ajouter une colonne
ko: 열 추가
tr: Sütun Ekle
vi: Thêm cột
zh_hans: 添加列
zh_hant: 新增欄位

source: The Keychain could not be read, so the stored secrets are not shown. Editing the name is safe; they are left as they are.
fr: Le porte-clés n'a pas pu être lu, donc les secrets stockés ne sont pas affichés. La modification du nom est sécurisée ; ils restent tels qu'ils sont.

source: Add Folder…
fr: Ajouter un dossier...
ko: 폴더 추가…
tr: Klasör Ekle…
vi: Thêm Thư mục…
zh_hans: 添加文件夹…
zh_hant: 新增資料夾…

source: Describe Table
fr: Décrire la table
ko: 테이블 설명
tr: Tabloyu Açıkla
vi: Mô tả bảng
zh_hans: 描述表
zh_hant: 描述資料表

source: Safe Mode, Safe Mode (Full), and Read-Only require a Pro license.
fr: Le mode sécurisé, le mode sécurisé (plein) et le mode lecture seule nécessitent une licence Pro.
ko: 안전 모드, 안전 모드(전체) 및 읽기 전용 기능에는 Pro 라이선스가 필요합니다.
tr: Güvenli Mod, Güvenli Mod (Tam) ve Salt Okunur için Pro lisans gereklidir.
vi: Chế độ an toàn, Chế độ an toàn (toàn phần) và Chỉ đọc yêu cầu giấy phép Pro.
zh_hans: 安全模式、安全模式（完整）和只读模式需要 Pro 许可证。
zh_hant: 安全模式、安全模式（完整）和唯讀模式需要 Pro 授權。

source: No tables were compared. Choose the tables to compare, then press Compare.
fr: Aucune table n'a été comparée. Choisissez les tables à comparer, puis appuyez sur Comparer.
ko: 비교한 테이블이 없습니다. 비교할 테이블을 선택한 다음 비교를 누르십시오.
tr: Hiçbir tablo karşılaştırılmadı. Karşılaştırılacak tabloları seçin, sonra Karşılaştır'a basın.
vi: Chưa có bảng nào được so sánh. Chọn các bảng cần so sánh, rồi nhấn So sánh.
zh_hans: 没有比较任何表。选择要比较的表，然后点按“比较”。
zh_hant: 沒有比較任何資料表。選擇要比較的資料表，然後按下「比較」。

source: Built-in plugins cannot be uninstalled
fr: Les plugins intégrés ne peuvent pas être désinstallés.
ko: 내장 플러그인은 제거할 수 없습니다
tr: Yerleşik eklentiler kaldırılamaz
vi: Không thể gỡ cài đặt plugin tích hợp sẵn
zh_hans: 无法卸载内置插件
zh_hant: 無法解除安裝內建外掛

source: RECENT
fr: Récent
ko: 최근
vi: GẦN ĐÂY
zh_hans: 最近
zh_hant: 最近

source: Development
fr: Développement
ko: 개발
tr: Geliştirme
vi: Phát triển
zh_hans: 开发
zh_hant: 開發

source: %d rows exist on the other side outside its filter. They are never written. Widen the filter to sync them.
fr: %d lignes existent de l'autre côté en dehors de son filtre. Elles ne sont jamais écrites. Élargissez le filtre pour les synchroniser.

source: Guidance the AI sees on every chat turn for this connection: table conventions, columns to avoid, join hints, business rules the schema doesn't show.
fr: Les directives que l'IA voit à chaque tour de discussion pour cette connexion : conventions de table, colonnes à éviter, indices de connexion, règles commerciales que le schéma ne montre pas.

source: using %@
fr: Utiliser %@
ko: %@ 사용 중
tr: %@ kullanılıyor
vi: đang dùng %@
zh_hans: 使用 %@
zh_hant: 使用 %@

source: Charts need a numeric column for the Y axis. This result has none.
fr: Les graphiques ont besoin d'une colonne numérique pour l'axe Y. Ce résultat n'en a pas.
ko: 차트에는 Y축으로 쓸 숫자 열이 필요합니다. 이 결과에는 없습니다.
tr: Grafikler Y ekseni için sayısal bir sütuna ihtiyaç duyar. Bu sonuçta yok.
vi: Biểu đồ cần một cột số cho trục Y. Kết quả này không có cột nào.
zh_hans: 图表的 Y 轴需要一个数值列，此结果没有。
zh_hant: 圖表的 Y 軸需要一個數值欄，此結果沒有。

source: This puts the AI-generated SQL into the query editor, replacing what is there. Nothing runs until you execute it.
fr: Cela place les requêtes SQL générées par l'IA dans l'éditeur de requêtes, remplaçant ce qui y est déjà. Rien ne s'exécute tant que vous ne l'exécutez pas.
ko: AI가 생성한 SQL을 쿼리 편집기에 넣고 기존 내용을 대체합니다. 직접 실행하기 전까지는 아무것도 실행되지 않습니다.
tr: Bu, yapay zekanın ürettiği SQL'i sorgu düzenleyiciye koyar ve oradakinin yerini alır. Siz çalıştırana kadar hiçbir şey yürütülmez.
vi: Thao tác này đưa SQL do AI tạo vào trình soạn truy vấn, thay cho nội dung hiện có. Không có gì chạy cho đến khi bạn thực thi.
zh_hans: 此操作会把 AI 生成的 SQL 放入查询编辑器，替换其中的内容。在你执行之前不会运行任何语句。
zh_hant: 此操作會把 AI 產生的 SQL 放入查詢編輯器，取代其中的內容。在你執行之前不會執行任何陳述式。

source: Unsupported database scheme: %@
fr: Scheme de base de données non pris en charge : %@
ko: 지원되지 않는 데이터베이스 스킴: %@
tr: Desteklenmeyen veritabanı şeması: %@
vi: Scheme cơ sở dữ liệu không được hỗ trợ: %@
zh_hans: 不支持的数据库方案：%@
zh_hant: 不支援的資料庫 scheme：%@

source: Cloud Native
fr: Native au nuage
ko: 클라우드 네이티브
tr: Bulut tabanlı
zh_hans: 云原生
zh_hant: 雲端原生

source: Saved selections
fr: Sélections enregistrées

source: Password is sent via keyboard-interactive challenge-response.
fr: Le mot de passe est envoyé via un défi-réponse interactif au clavier.
ko: 암호는 키보드 대화형 챌린지-응답을 통해 전송됩니다.
tr: Parola, keyboard-interactive soru-cevap yöntemiyle gönderilir.
vi: Mật khẩu được gửi qua keyboard-interactive challenge-response.
zh_hans: 密码通过 keyboard-interactive 质询-响应方式发送。
zh_hant: 密碼透過 keyboard-interactive 質詢-回應方式傳送。

source: MCP Server: Stopped
fr: Serveur MCP : Arrêté
ko: MCP 서버: 중지됨
tr: MCP Sunucusu: Durduruldu
vi: MCP Server: Đã dừng
zh_hans: MCP 服务器：已停止
zh_hant: MCP 伺服器：已停止

source: Reasoning…
fr: Raisonnement...
ko: 추론 중…
tr: Akıl yürütüyor…
vi: Đang suy luận…
zh_hans: 推理中…
zh_hant: 推理中…

source: Cannot save the edited row in '%1$@'. %2$@
fr: Impossible d'enregistrer la ligne modifiée dans '%1$@'. %2$@

source: Preview %@ (⌘⇧P)
fr: Aperçu %@ (⌘⇧P)
ko: %@ 미리보기(⌘⇧P)
tr: Önizleme %@ (⌘⇧P)
vi: Xem trước %@ (⌘⇧P)
zh_hans: 预览 %@ (⌘⇧P)
zh_hant: 預覽 %@ (⌘⇧P)

source: Only in Source
fr: Seulement dans la source
ko: 원본에만 있음
tr: Yalnızca Kaynakta
vi: Chỉ có ở nguồn
zh_hans: 仅在来源中
zh_hant: 僅在來源中

source: Statement Completed
fr: Déclaration complétée

source: Its expression %@ is written in the source's own dialect, so the column is created as an ordinary one and its values are copied.
fr: Son expression %@ est écrite dans le dialecte propre de la source, de sorte que la colonne est créée comme une colonne ordinaire et ses valeurs sont copiées.

source: This connection uses a credential profile that isn't on this Mac.
fr: Cette connexion utilise un profil de connexion qui n'est pas sur ce Mac.

source: Primary Preferred
fr: Préféré primaire

source: Card Background
fr: Fond de carte
ko: 카드 배경
tr: Kart Arka Planı
vi: Nền thẻ
zh_hans: 卡片背景
zh_hant: 卡片背景

source: Toggle AI Chat
fr: Activer ou désactiver le chat IA
ko: AI 채팅 표시/숨기기
vi: Bật/tắt AI Chat
zh_hans: 切换 AI 聊天
zh_hant: 切換 AI 聊天

source: Partly granted
fr: Partiellement accordé
ko: 일부 권한이 부여됨
tr: Kısmen verildi
vi: Cấp một phần
zh_hans: 部分授予
zh_hant: 部分授予

source: Default row limit
fr: Limite par défaut de la ligne
ko: 기본 행 제한
tr: Varsayılan satır limiti
vi: Giới hạn dòng mặc định
zh_hans: 默认行数限制
zh_hant: 預設列數上限

source: UUID of the saved connection
fr: UUID de la connexion enregistrée
ko: 저장된 연결의 UUID
tr: Kaydedilmiş bağlantının UUID'si
vi: UUID của kết nối đã lưu
zh_hans: 已保存连接的 UUID
zh_hant: 已儲存連線的 UUID

source: View Options
fr: Voir les options
ko: 보기 옵션
tr: Görünüm Seçenekleri
vi: Tuỳ chọn hiển thị
zh_hans: 显示选项
zh_hant: 顯示選項

source: Passphrase (8+ characters)
fr: Mot de passe (8+ caractères)
ko: 암호 구문(8자 이상)
tr: Parola (8+ karakter)
vi: Cụm mật khẩu (8+ ký tự)
zh_hans: 密码短语（8 个以上字符）
zh_hant: 通關密語（8 個以上字）

source: This server has no users or roles you can manage.
fr: Ce serveur n'a pas d'utilisateurs ou de rôles que vous pouvez gérer.
ko: 이 서버에는 관리할 수 있는 사용자 또는 역할이 없습니다.
tr: Bu sunucuda yönetebileceğiniz kullanıcı veya rol yok.
vi: Máy chủ này không có người dùng hoặc vai trò nào bạn quản lý được.
zh_hans: 此服务器没有你可以管理的用户或角色。
zh_hant: 此伺服器沒有你可以管理的使用者或角色。

source: Switch to this database before executing
fr: Changez à cette base de données avant d'exécuter.
ko: 실행 전에 이 데이터베이스로 전환
tr: Yürütmeden önce bu veritabanına geç
vi: Chuyển sang cơ sở dữ liệu này trước khi thực thi
zh_hans: 执行前切换到此数据库
zh_hant: 執行前切換到此資料庫

source: Export Results…
fr: Exporter les résultats...
ko: 결과 내보내기…
tr: Sonuçları Dışa Aktar…
vi: Export Kết Quả…
zh_hans: 导出结果…
zh_hant: 匯出結果…

source: Drop Database...
fr: Déposer la base de données...
ko: 데이터베이스 삭제...
tr: Veritabanını Sil...
vi: Xoá cơ sở dữ liệu...
zh_hans: 删除数据库…
zh_hant: 刪除資料庫…

source: Install Theme
fr: Installer le thème
ko: 테마 설치
tr: Temayı Yükle
vi: Cài đặt chủ đề
zh_hans: 安装主题
zh_hant: 安裝主題

source: Table and view names, without columns
fr: Noms de table et de vue, sans colonnes
ko: 열을 제외한 테이블 및 뷰 이름
tr: Sütunlar olmadan tablo ve görünüm adları
vi: Tên bảng và view, không kèm cột
zh_hans: 表和视图名称，不含列
zh_hant: 資料表和檢視表名稱，不含欄位

source: The tunnel command exited before the port was open: %@
fr: La commande du tunnel a été terminée avant que le port ne soit ouvert : %@

source: The Cloud SQL Auth Proxy failed to start: %@
fr: Le proxy Cloud SQL Auth n'a pas pu démarrer : %@
ko: Cloud SQL Auth Proxy를 시작하지 못했습니다: %@
tr: Cloud SQL Auth Proxy başlatılamadı: %@
vi: Cloud SQL Auth Proxy không khởi động được: %@
zh_hans: Cloud SQL Auth Proxy 启动失败：%@
zh_hant: Cloud SQL Auth Proxy 啟動失敗：%@

source: Enabled
fr: Activé
ko: 활성화됨
tr: Etkin
vi: Đã bật
zh_hans: 已启用
zh_hant: 已啟用

source: Any Selected Tag
fr: Toute balise sélectionnée

source: This driver does not expose routine DDL.
fr: Ce pilote n'expose pas la DDL de routine.
ko: 이 드라이버는 루틴 DDL을 제공하지 않습니다.
tr: Bu sürücü rutinler için DDL sağlamıyor.
vi: Driver này không cung cấp DDL của routine.
zh_hans: 此驱动不提供例程 DDL。
zh_hant: 此驅動程式不提供常式 DDL。

source: Code expired
fr: Code expiré
ko: 코드 만료됨
tr: Kod süresi doldu
vi: Mã đã hết hạn
zh_hans: 代码已过期
zh_hant: 驗證碼已過期

source: No tables
fr: Pas de tables
ko: 테이블 없음
tr: Tablo yok
vi: Không có bảng
zh_hans: 没有表
zh_hant: 沒有資料表

source: Replace
fr: Remplacer
ko: 바꾸기
tr: Değiştir
vi: Thay thế
zh_hans: 替换
zh_hant: 取代

source: No Privileges
fr: Pas de privilèges
ko: 권한 없음
tr: Yetki Yok
vi: Không có quyền
zh_hans: 无权限
zh_hant: 沒有權限

source: Cancel Backup Dump
fr: Annuler le décompte de sauvegarde
ko: 백업 덤프 취소
tr: Yedek Dökümünü İptal Et
vi: Hủy dump sao lưu
zh_hans: 取消备份转储
zh_hant: 取消資料庫備份

source: Column for %@
fr: Colonne pour %@

source: Most Run
fr: La plupart des courses
ko: 최다 실행
tr: En Çok Çalıştırılan
vi: Chạy nhiều nhất
zh_hans: 运行最多
zh_hant: 執行最多

source: Sign In with Browser…
fr: Se connecter avec le navigateur...
ko: 브라우저로 로그인…
tr: Tarayıcıyla Giriş Yap…
vi: Đăng nhập bằng trình duyệt…
zh_hans: 通过浏览器登录…
zh_hant: 透過瀏覽器登入…

source: A Kubernetes resource is required, such as service/postgres
fr: Un ressource Kubernetes est nécessaire, comme le service/postgres.

source: statement
fr: déclaration
ko: 문
vi: câu lệnh
zh_hans: 条语句
zh_hant: 陳述式

source: This account uses a password verifier the database driver does not support.
fr: Ce compte utilise un vérificateur de mot de passe que le pilote de base de données ne prend pas en charge.
ko: 이 계정은 데이터베이스 드라이버가 지원하지 않는 암호 검증 형식을 사용합니다.
tr: Bu hesap, veritabanı sürücüsünün desteklemediği bir parola doğrulayıcı kullanıyor.
vi: Tài khoản này dùng password verifier mà driver cơ sở dữ liệu không hỗ trợ.
zh_hans: 此账户使用了数据库驱动不支持的口令校验器。
zh_hant: 此帳戶使用了資料庫驅動程式不支援的密碼驗證器。

source: Use your Cursor subscription with no API key. Requires the Cursor CLI.
fr: Utilisez votre abonnement Cursor sans clé API. Nécessite la CLI Cursor.
ko: API 키 없이 Cursor 구독을 사용합니다. Cursor CLI가 필요합니다.
tr: API anahtarı olmadan Cursor aboneliğinizi kullanın. Cursor CLI gerektirir.
vi: Dùng gói đăng ký Cursor của bạn mà không cần khóa API. Yêu cầu Cursor CLI.
zh_hans: 无需 API 密钥即可使用你的 Cursor 订阅。需要 Cursor CLI。
zh_hant: 無需 API 金鑰即可使用你的 Cursor 訂閱。需要 Cursor CLI。

source: Include query results
fr: Inclure les résultats de la requête
ko: 쿼리 결과 포함
tr: Sorgu sonuçlarını dahil et
vi: Bao gồm kết quả truy vấn
zh_hans: 包含查询结果
zh_hant: 包含查詢結果

source: Choose a target to write to.
fr: Choisissez une cible à laquelle écrire.
ko: 기록할 대상을 선택하십시오.
tr: Yazılacak hedefi seçin.
vi: Chọn đích để ghi vào.
zh_hans: 选择要写入的目标。
zh_hant: 選擇要寫入的目標。

source: Choose Column
fr: Choisissez la colonne
ko: 열 선택
tr: Sütun Seç
vi: Chọn cột
zh_hans: 选择列
zh_hant: 選擇欄

source: None chosen
fr: Aucun n'a été choisi
ko: 선택 없음
tr: Hiçbiri seçilmedi
vi: Chưa chọn gì
zh_hans: 未选择任何项
zh_hant: 未選擇任何項目

source: Foreign keys are followed %d levels deep
fr: Les clés étrangères sont suivies à %d niveaux de profondeur.

source: %@ shapes
fr: %@ formes
ko: %@개 패턴
tr: %@ sorgu şekli
vi: %@ dạng truy vấn
zh_hans: %@ 种查询形态
zh_hant: %@ 種查詢形態

source: This discards your edits to the Chinook sample and restores the original copy.
fr: Cela rejette vos modifications apportées à l'échantillon Chinook et restaure la copie originale.
ko: Chinook 샘플의 편집 내용을 취소하고 원본을 복원합니다.
tr: Bu, Chinook örneğindeki düzenlemelerinizi atar ve özgün kopyayı geri yükler.
vi: Thao tác này bỏ các chỉnh sửa của bạn trên mẫu Chinook và khôi phục bản gốc.
zh_hans: 这将放弃你对 Chinook 示例的编辑并恢复原始副本。
zh_hant: 這會放棄你對 Chinook 範例的編輯，並還原成原始副本。

source: The %@ plugin is not installed. TablePro offers to install it on connect.
fr: Le plugin %@ n'est pas installé. TablePro vous propose de l'installer sur connect.
